app/controllers/note_controller.rb

  def remove
    @note = Note.find(:first, :conditions => { :UUID => params[:note][:UUID] })
---
SELECT * FROM `notes` WHERE (`notes`.`UUID` = '60E12AF04A8049B9A03D693ABA382727') LIMIT 1