app/controllers/note_controller.rb

  def save

    @note = Note.find(:first, :conditions => { :UUID => params[:note][:UUID] })

    if @note.blank?
      @note = Note.new(params[:note])
    else
      @note.attributes=(params[:note])
    end


    @note.user_id = session[:usr].id;
    if @note.save
---
SELECT * FROM `notes` WHERE (`notes`.`UUID` = '9B0975DEE8D84588847AC48563C107E7') LIMIT 1
INSERT INTO `notes` (`categoria`, `created_at`, `titulo`, `updated_at`, `trashed`, `conteudo`, `posX`, `user_id`, `UUID`, `posY`, `height`, `shared`, `prioridade`, `width`, `state`) VALUES(0, '2010-09-15 00:41:47', '', '2010-09-15 00:41:47', 0, 'Lembrete...', '879', 1, '9B0975DEE8D84588847AC48563C107E7', '166', '160', 0, NULL, '150', '1')
UPDATE `notes` SET `updated_at` = '2010-09-15 01:27:03', `posY` = '256', `conteudo` = 'O menu direito nã', `posX` = '470' WHERE `id` = 72

  def trash
    @note = Note.find(:first, :conditions => { :UUID => params[:note][:UUID] })

    unless @note.blank?
      @note.trashed = true
      @note.save
---
SELECT * FROM `notes` WHERE (`notes`.`UUID` = '99B731EC2669438D8578A1A12FB7714F') LIMIT 1
UPDATE `notes` SET `trashed` = 1, `updated_at` = '2010-09-15 02:45:38' WHERE `id` = 74

  def view_trash
    @note = Note.find(:all, :conditions => { :trashed => true, :user_id => session[:usr].id}, :order => "notes.id DESC, notes.created_at DESC");
---
SELECT * FROM `notes` WHERE (`notes`.`user_id` = 1 AND `notes`.`trashed` = 1) ORDER BY notes.id DESC, notes.created_at DESC

  def remove
    @note = Note.find(:first, :conditions => { :id => params[:note][:id] })
    unless @note.blank?
      @note.delete
---
SELECT * FROM `notes` WHERE (`notes`.`id` = '103') LIMIT 1
DELETE FROM `notes` WHERE (`id` IN (103))

  def recycle
    @note = Note.find(:first, :conditions => { :id => params[:note][:id] })

    unless @note.blank?
      @note.trashed = false
      @note.save
---
SELECT * FROM `notes` WHERE (`notes`.`id` IS NULL) LIMIT 1
UPDATE `notes` SET `trashed` = 0, `updated_at` = '2010-11-24 15:31:46' WHERE `id` = 108