app/controllers/office_controller.rb

  def index
    @note = Note.find(:all, :conditions => {'trashed' => false, 'user_id' => session[:usr].id} )
    if @note.blank?
      @note = Note.new()
      @note.trashed = false
      @note.user_id = session[:usr].id
      @note.conteudo = 'Bem vindo ao OfficeDesk, clique com o botão direito para acessar o menu.'
      @note.posX = '200'
      @note.posY = '170'
      @note.width = '150'
      @note.height = '160'
      @note.save
---
SELECT * FROM `notes` WHERE (`notes`.`trashed` = 0 AND `notes`.`user_id` IS NULL)
SELECT * FROM `notes`
INSERT INTO `notes` (`categoria`, `created_at`, `titulo`, `updated_at`, `trashed`, `conteudo`, `posX`, `user_id`, `UUID`, `posY`, `height`, `shared`, `prioridade`, `width`, `state`) VALUES(0, '2010-09-14 23:52:32', NULL, '2010-09-14 23:52:32', 0, 'Bem vindo ao OfficeDesk, clique com o botão direito para acessar o menu.', '200', NULL, NULL, '170', '160', 0, NULL, '150', NULL)