app/controllers/usuarios_controller.rb

SELECT * FROM `usuarios` WHERE (`usuarios`.`id` = '--- :fist\n' AND (login = 'SAnjos' and senha = 'sasa'))
---
  def login
    usr = Usuario.find(:first, :conditions => (['login=? AND senha=?', params[:login]["login"], params[:login]["senha"]]))

INSERT INTO `usuarios` (`nivel`, `created_at`, `nome`, `updated_at`, `login`, `email`, `senha`) VALUES(NULL, '2010-09-01 03:18:18', 'nome do usuario', '2010-09-01 03:18:18', 'login', 'email@emp.com.br', '123456')
---
  def create
    @usuario = Usuario.new(params[:usuario])

    if @usuario.save