app/controllers/usuarios_controller.rb

  def esqueceu_senha
    @usuario = Usuario.find(:first, :conditions => {:login => params[:esqueceu][:login], :email => params[:esqueceu][:email]})
---
SELECT * FROM `usuarios` WHERE (`usuarios`.`email` = 'guilherme.sanjos@gmail.com' AND `usuarios`.`login` = 'Sanjos') LIMIT 1